lib/tasks/rufus_job.rake

task rufus_job: [:environment] do
  scheduler = Rufus::Scheduler.new

  scheduler.every '10m' do
    ActiveRecord::Base.connection_pool.with_connection do
      Application.find_each do |app|
        app.update_column(:chats_count, app.chats.size)
      end
      Chat.find_each do |chat|
        chat.update_column(:messages_count, chat.messages.size)
---
SELECT  `applications`.* FROM `applications` ORDER BY `applications`.`id` ASC LIMIT 1000
SELECT  `chats`.* FROM `chats` ORDER BY `chats`.`id` ASC LIMIT 1000
SELECT COUNT(*) FROM `messages` WHERE `messages`.`chat_id` = 1
UPDATE `chats` SET `messages_count` = 0 WHERE `chats`.`id` = 1