app/workers/chat_worker.rb

INSERT INTO `chats` (`number`, `application_id`, `created_at`, `updated_at`, `application_token`) VALUES (1, 10, '2022-11-13 11:23:01', '2022-11-13 11:23:01', '1a72ad53-98cc-4272-b44d-f429d89df502')
---
  def perform( application_token, chat_number,application_id)
    ActiveRecord::Base.connection_pool.with_connection do
      Chat.create!(
        application_token: application_token,
        number: chat_number,
        application_id: application_id,
      )