app/controllers/applications_controller.rb

  def index
    applications = Application.all
---
SELECT `applications`.* FROM `applications`

  def show
    application = Application.find_by(token: params[:appToken])
---
SELECT  `applications`.* FROM `applications` WHERE `applications`.`token` = '8cfc2f7d-253d-41ad-87b4-3220858dc079' LIMIT 1

  def create
    if params[:name] and params[:name] != ""
      app = Application.new(
          name: params[:name],
          token: SecureRandom.base64(12),
        )
      if app.save
---
INSERT INTO `applications` (`name`, `token`, `created_at`, `updated_at`) VALUES ('application15', '303e5b00-b2a5-4c06-a7da-2da07d7cebed', '2022-11-16 08:18:04', '2022-11-16 08:18:04')

  def update
    if params[:name] and params[:name] != ""
      application = Application.find_by(token: params[:appToken])
      if application
        if application.update(params.require(:application).permit(:name))
---
SELECT  `applications`.* FROM `applications` WHERE `applications`.`token` = '303e5b00-b2a5-4c06-a7da-2da07d7cebed' LIMIT 1
UPDATE `applications` SET `name` = 'updatedApplication', `updated_at` = '2022-11-16 08:32:03' WHERE `applications`.`id` = 14