app/controllers/chats_controller.rb

SELECT  `applications`.* FROM `applications` WHERE `applications`.`token` = '8cfc2f7d-253d-41ad-87b4-3220858dc079' LIMIT 1
---
  def index
    application = Application.find_by(token: params[:application_token])

SELECT  `chats`.* FROM `chats` WHERE `chats`.`number` = 1 AND `chats`.`application_token` = '8cfc2f7d-253d-41ad-87b4-3220858dc079' LIMIT 1
---
  def show
    chat = Chat.find_by(number: params[:number], application_token: params[:application_token])

SELECT  `applications`.* FROM `applications` WHERE `applications`.`token` = '8cfc2f7d-253d-41ad-87b4-3220858dc079' LIMIT 1
---
  def create
    application = Application.find_by(token: params[:application_token])