app/controllers/messages_controller.rb

SELECT  `chats`.* FROM `chats` WHERE `chats`.`number` = 1 AND `chats`.`application_token` = '8cfc2f7d-253d-41ad-87b4-3220858dc079' LIMIT 1
---
  def index
    chat = Chat.find_by(number: params[:chatNumber], application_token: params[:appToken])

SELECT  `chats`.* FROM `chats` WHERE `chats`.`number` = 1 AND `chats`.`application_token` = '94Rhvro9KInqij1H' LIMIT 1
---
  def create
    if params[:body] and params[:body] != ""
      chat = Chat.find_by(number: params[:chatNumber], application_token: params[:appToken])

SELECT  `chats`.* FROM `chats` WHERE `chats`.`number` = 1 AND `chats`.`application_token` = '8cfc2f7d-253d-41ad-87b4-3220858dc079' LIMIT 1
---
  def search
    chat = Chat.find_by(number: params[:chatNumber], application_token: params[:appToken])

SELECT  `chats`.* FROM `chats` WHERE `chats`.`number` = 0 AND `chats`.`application_token` = ':appToken' LIMIT 1
SELECT  `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 38 AND `messages`.`number` = 0 LIMIT 1
---
  def show
    chat = Chat.find_by(number: params[:chatNumber], application_token: params[:appToken])
    if chat
      message = chat.messages.find_by(number: params[:number])

SELECT  `chats`.* FROM `chats` WHERE `chats`.`number` IS NULL AND `chats`.`application_token` IS NULL LIMIT 1
SELECT  `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 22 AND `messages`.`number` = 1 LIMIT 1
UPDATE `messages` SET `body` = 'new hello message', `updated_at` = '2022-11-16 08:44:50' WHERE `messages`.`id` = 1
---
  def update
    if params[:body] and params[:body] != ""
      chat = Chat.find_by(number: params[:chatNumber], application_token: params[:appToken])
      if chat
        message = chat.messages.find_by(number: params[:number])
        if message
          if message.update(params.require(:message).permit(:body))